In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5, 6],
                   'b': [1, 1, 2, 3, 5, 8],
                   'c': [1, 4, 9, 16, 25, 36]})

In [3]:
df

   a  b   c
0  1  1   1
1  2  1   4
2  3  2   9
3  4  3  16
4  5  5  25
5  6  8  36

In [4]:
df[-3:]['a'].diff()

3    NaN
4    1.0
5    1.0
Name: a, dtype: float64

In [5]:
df[-3:]['a'].diff().values

array([nan,  1.,  1.])

In [6]:
df[-3:]['a'].diff().values[1]

1.0

In [7]:
df.loc[5]['a']=11

In [8]:
df

    a  b   c
0   1  1   1
1   2  1   4
2   3  2   9
3   4  3  16
4   5  5  25
5  11  8  36

In [9]:
df['d']=[np.nan,2,3,4,5,6]

In [10]:
df

    a  b   c    d
0   1  1   1  NaN
1   2  1   4  2.0
2   3  2   9  3.0
3   4  3  16  4.0
4   5  5  25  5.0
5  11  8  36  6.0

In [11]:
df['e']=df['c']-df['d']

In [12]:
df

    a  b   c    d     e
0   1  1   1  NaN   NaN
1   2  1   4  2.0   2.0
2   3  2   9  3.0   6.0
3   4  3  16  4.0  12.0
4   5  5  25  5.0  20.0
5  11  8  36  6.0  30.0

In [13]:
df[0:3]['e'].sum()

8.0

In [14]:
df['f'] = 0

In [15]:
df

    a  b   c    d     e  f
0   1  1   1  NaN   NaN  0
1   2  1   4  2.0   2.0  0
2   3  2   9  3.0   6.0  0
3   4  3  16  4.0  12.0  0
4   5  5  25  5.0  20.0  0
5  11  8  36  6.0  30.0  0

In [30]:
v=[np.nan]
for i in range(1,len(df['c'])):
    v.append(df.loc[i-1]['e']+df.loc[i]['e'])

In [31]:
v

[nan, nan, 8.0, 18.0, 32.0, 50.0]

In [32]:
df['g']=v

In [33]:
df

    a  b   c    d     e  f     g
0   1  1   1  NaN   NaN  0   NaN
1   2  1   4  2.0   2.0  0   NaN
2   3  2   9  3.0   6.0  0   8.0
3   4  3  16  4.0  12.0  0  18.0
4   5  5  25  5.0  20.0  0  32.0
5  11  8  36  6.0  30.0  0  50.0